Revit 2027 API
BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationHasSystemWarning Property
 The selected fixture is part of a system with different classification. System calculations (e.g. flow analysis) are not possible between systems with different classifications.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchedSystemClassificationHasSystemWarning { get; }
Public Shared ReadOnly Property MismatchedSystemClassificationHasSystemWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchedSystemClassificationHasSystemWarning {
	FailureDefinitionId^ get ();
}
static member MismatchedSystemClassificationHasSystemWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace